## Plan Result (stg_backendappgateway - TerraformPlanApply)




<pre><code>Plan: 1 to add, 2 to change, 0 to destroy.</code></pre>

* Create
  * module.privatedns.azurerm_private_dns_a_record.this[&#34;darts-external-component-test-harness&#34;]
* Update
  * module.backendappgateway.azurerm_application_gateway.ag[0]
  * module.backendappgateway.azurerm_monitor_diagnostic_setting.diagnostics_access_logs_sa[0]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.backendappgateway.azurerm_application_gateway.ag[0] will be updated in-place
  ~ resource "azurerm_application_gateway" "ag" {
        id                                = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks00-stg-agw"
        name                              = "aks00-stg-agw"
        tags                              = {
            "application"  = "core"
            "autoShutdown" = "true"
            "builtFrom"    = "hmcts/sds-azure-platform"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "High"
            "environment"  = "staging"
            "startupMode"  = "always"
        }
        # (8 unchanged attributes hidden)

      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.148.15.250",
              + "10.148.31.250",
            ]
          + name         = "darts-external-component-test-harness"
        }

      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks00-stg-agw/backendHttpSettingsCollection/darts-api" -> null
          - name                                = "darts-api" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks00-stg-agw/probes/darts-api" -> null
          - probe_name                          = "darts-api" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
            # (3 unchanged attributes hidden)
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks00-stg-agw/backendHttpSettingsCollection/darts-gateway" -> null
          - name                                = "darts-gateway" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks00-stg-agw/probes/darts-gateway" -> null
          - probe_name                          = "darts-gateway" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
            # (3 unchanged attributes hidden)
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks00-stg-agw/backendHttpSettingsCollection/darts-stub-services" -> null
          - name                                = "darts-stub-services" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks00-stg-agw/probes/darts-stub-services" -> null
          - probe_name                          = "darts-stub-services" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
            # (3 unchanged attributes hidden)
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks00-stg-agw/backendHttpSettingsCollection/darts-ucf-test-harness" -> null
          - name                                = "darts-ucf-test-harness" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks00-stg-agw/probes/darts-ucf-test-harness" -> null
          - probe_name                          = "darts-ucf-test-harness" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
            # (3 unchanged attributes hidden)
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks00-stg-agw/backendHttpSettingsCollection/juror-api" -> null
          - name                                = "juror-api" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks00-stg-agw/probes/juror-api" -> null
          - probe_name                          = "juror-api" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
            # (3 unchanged attributes hidden)
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks00-stg-agw/backendHttpSettingsCollection/juror-pnc" -> null
          - name                                = "juror-pnc" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks00-stg-agw/probes/juror-pnc" -> null
          - probe_name                          = "juror-pnc" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
            # (3 unchanged attributes hidden)
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks00-stg-agw/backendHttpSettingsCollection/juror-scheduler-api" -> null
          - name                                = "juror-scheduler-api" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks00-stg-agw/probes/juror-scheduler-api" -> null
          - probe_name                          = "juror-scheduler-api" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
            # (3 unchanged attributes hidden)
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks00-stg-agw/backendHttpSettingsCollection/juror-scheduler-execution" -> null
          - name                                = "juror-scheduler-execution" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks00-stg-agw/probes/juror-scheduler-execution" -> null
          - probe_name                          = "juror-scheduler-execution" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
            # (3 unchanged attributes hidden)
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks00-stg-agw/backendHttpSettingsCollection/lgy-iac-web" -> null
          - name                                = "lgy-iac-web" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks00-stg-agw/probes/lgy-iac-web" -> null
          - probe_name                          = "lgy-iac-web" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
            # (3 unchanged attributes hidden)
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks00-stg-agw/backendHttpSettingsCollection/opal-external-api" -> null
          - name                                = "opal-external-api" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks00-stg-agw/probes/opal-external-api" -> null
          - probe_name                          = "opal-external-api" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
            # (3 unchanged attributes hidden)
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks00-stg-agw/backendHttpSettingsCollection/opal-fines-service" -> null
          - name                                = "opal-fines-service" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks00-stg-agw/probes/opal-fines-service" -> null
          - probe_name                          = "opal-fines-service" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
            # (3 unchanged attributes hidden)
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks00-stg-agw/backendHttpSettingsCollection/opal-legacy-db-stub" -> null
          - name                                = "opal-legacy-db-stub" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks00-stg-agw/probes/opal-legacy-db-stub" -> null
          - probe_name                          = "opal-legacy-db-stub" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
            # (3 unchanged attributes hidden)
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks00-stg-agw/backendHttpSettingsCollection/opal-log-audit-service" -> null
          - name                                = "opal-log-audit-service" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks00-stg-agw/probes/opal-log-audit-service" -> null
          - probe_name                          = "opal-log-audit-service" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
            # (3 unchanged attributes hidden)
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks00-stg-agw/backendHttpSettingsCollection/opal-print-service" -> null
          - name                                = "opal-print-service" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks00-stg-agw/probes/opal-print-service" -> null
          - probe_name                          = "opal-print-service" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
            # (3 unchanged attributes hidden)
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks00-stg-agw/backendHttpSettingsCollection/opal-service-auth-provider-app" -> null
          - name                                = "opal-service-auth-provider-app" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks00-stg-agw/probes/opal-service-auth-provider-app" -> null
          - probe_name                          = "opal-service-auth-provider-app" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
            # (3 unchanged attributes hidden)
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks00-stg-agw/backendHttpSettingsCollection/pdda-public-display-data-aggregator" -> null
          - name                                = "pdda-public-display-data-aggregator" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks00-stg-agw/probes/pdda-public-display-data-aggregator" -> null
          - probe_name                          = "pdda-public-display-data-aggregator" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
            # (3 unchanged attributes hidden)
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks00-stg-agw/backendHttpSettingsCollection/pdda-public-display-manager" -> null
          - name                                = "pdda-public-display-manager" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks00-stg-agw/probes/pdda-public-display-manager" -> null
          - probe_name                          = "pdda-public-display-manager" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
         

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

-network-rg/providers/Microsoft.Network/applicationGateways/aks00-stg-agw/backendHttpSettingsCollection/vh-video-api"
          + backend_http_settings_name = "vh-video-api"
          + http_listener_id           = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks00-stg-agw/httpListeners/vh-video-api"
          + http_listener_name         = "vh-video-api"
          + id                         = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks00-stg-agw/requestRoutingRules/vh-video-api"
          + name                       = "vh-video-api"
          + priority                   = 30
          + rule_type                  = "Basic"
            # (3 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "darts-external-component-test-harness"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "darts-external-component-test-harness"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "darts-external-component-test-harness"
          + id                          = (known after apply)
          + name                        = "darts-external-component-test-harness"
          + priority                    = 180
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rule_type                   = "Basic"
          + url_path_map_id             = (known after apply)
            # (3 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "juror-api"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "juror-api"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "juror-api"
          + id                          = (known after apply)
          + name                        = "juror-api"
          + priority                    = 240
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rule_type                   = "Basic"
          + url_path_map_id             = (known after apply)
            # (3 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "juror-pnc"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "juror-pnc"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "juror-pnc"
          + id                          = (known after apply)
          + name                        = "juror-pnc"
          + priority                    = 230
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rule_type                   = "Basic"
          + url_path_map_id             = (known after apply)
            # (3 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "juror-scheduler-api"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "juror-scheduler-api"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "juror-scheduler-api"
          + id                          = (known after apply)
          + name                        = "juror-scheduler-api"
          + priority                    = 210
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rule_type                   = "Basic"
          + url_path_map_id             = (known after apply)
            # (3 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "juror-scheduler-execution"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "juror-scheduler-execution"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "juror-scheduler-execution"
          + id                          = (known after apply)
          + name                        = "juror-scheduler-execution"
          + priority                    = 220
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rule_type                   = "Basic"
          + url_path_map_id             = (known after apply)
            # (3 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "opal-external-api"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "opal-external-api"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "opal-external-api"
          + id                          = (known after apply)
          + name                        = "opal-external-api"
          + priority                    = 300
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rule_type                   = "Basic"
          + url_path_map_id             = (known after apply)
            # (3 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "opal-fines-service"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "opal-fines-service"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "opal-fines-service"
          + id                          = (known after apply)
          + name                        = "opal-fines-service"
          + priority                    = 250
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rule_type                   = "Basic"
          + url_path_map_id             = (known after apply)
            # (3 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "opal-legacy-db-stub"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "opal-legacy-db-stub"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "opal-legacy-db-stub"
          + id                          = (known after apply)
          + name                        = "opal-legacy-db-stub"
          + priority                    = 260
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rule_type                   = "Basic"
          + url_path_map_id             = (known after apply)
            # (3 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "opal-log-audit-service"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "opal-log-audit-service"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "opal-log-audit-service"
          + id                          = (known after apply)
          + name                        = "opal-log-audit-service"
          + priority                    = 280
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rule_type                   = "Basic"
          + url_path_map_id             = (known after apply)
            # (3 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "opal-print-service"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "opal-print-service"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "opal-print-service"
          + id                          = (known after apply)
          + name                        = "opal-print-service"
          + priority                    = 270
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rule_type                   = "Basic"
          + url_path_map_id             = (known after apply)
            # (3 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "opal-service-auth-provider-app"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "opal-service-auth-provider-app"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "opal-service-auth-provider-app"
          + id                          = (known after apply)
          + name                        = "opal-service-auth-provider-app"
          + priority                    = 290
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rule_type                   = "Basic"
          + url_path_map_id             = (known after apply)
            # (3 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "pdda-public-display-data-aggregator"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "pdda-public-display-data-aggregator"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "pdda-public-display-data-aggregator"
          + id                          = (known after apply)
          + name                        = "pdda-public-display-data-aggregator"
          + priority                    = 310
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rule_type                   = "Basic"
          + url_path_map_id             = (known after apply)
            # (3 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "pdda-public-display-manager"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "pdda-public-display-manager"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "pdda-public-display-manager"
          + id                          = (known after apply)
          + name                        = "pdda-public-display-manager"
          + priority                    = 320
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rule_type                   = "Basic"
          + url_path_map_id             = (known after apply)
            # (3 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "pre-api"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "pre-api"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "pre-api"
          + id                          = (known after apply)
          + name                        = "pre-api"
          + priority                    = 200
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rule_type                   = "Basic"
          + url_path_map_id             = (known after apply)
            # (3 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "pre-portal"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "pre-portal"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "pre-portal"
          + id                          = (known after apply)
          + name                        = "pre-portal"
          + priority                    = 190
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rule_type                   = "Basic"
          + url_path_map_id             = (known after apply)
            # (3 unchanged attributes hidden)
        }

      ~ rewrite_rule_set {
            id   = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks00-stg-agw/rewriteRuleSets/pre-portal"
          ~ name = "pre-portal" -> "darts-external-component-test-harness"
        }
      ~ rewrite_rule_set {
            id   = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks00-stg-agw/rewriteRuleSets/pre-api"
          ~ name = "pre-api" -> "pre-portal"
        }
      ~ rewrite_rule_set {
            id   = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks00-stg-agw/rewriteRuleSets/juror-scheduler-api"
          ~ name = "juror-scheduler-api" -> "pre-api"
        }
      ~ rewrite_rule_set {
            id   = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks00-stg-agw/rewriteRuleSets/juror-scheduler-execution"
          ~ name = "juror-scheduler-execution" -> "juror-scheduler-api"
        }
      ~ rewrite_rule_set {
            id   = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks00-stg-agw/rewriteRuleSets/juror-pnc"
          ~ name = "juror-pnc" -> "juror-scheduler-execution"
        }
      ~ rewrite_rule_set {
            id   = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks00-stg-agw/rewriteRuleSets/juror-api"
          ~ name = "juror-api" -> "juror-pnc"
        }
      ~ rewrite_rule_set {
            id   = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks00-stg-agw/rewriteRuleSets/opal-fines-service"
          ~ name = "opal-fines-service" -> "juror-api"
        }
      ~ rewrite_rule_set {
            id   = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks00-stg-agw/rewriteRuleSets/opal-legacy-db-stub"
          ~ name = "opal-legacy-db-stub" -> "opal-fines-service"
        }
      ~ rewrite_rule_set {
            id   = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks00-stg-agw/rewriteRuleSets/opal-print-service"
          ~ name = "opal-print-service" -> "opal-legacy-db-stub"
        }
      ~ rewrite_rule_set {
            id   = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks00-stg-agw/rewriteRuleSets/opal-log-audit-service"
          ~ name = "opal-log-audit-service" -> "opal-print-service"
        }
      ~ rewrite_rule_set {
            id   = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks00-stg-agw/rewriteRuleSets/opal-service-auth-provider-app"
          ~ name = "opal-service-auth-provider-app" -> "opal-log-audit-service"
        }
      ~ rewrite_rule_set {
            id   = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks00-stg-agw/rewriteRuleSets/opal-external-api"
          ~ name = "opal-external-api" -> "opal-service-auth-provider-app"
        }
      ~ rewrite_rule_set {
            id   = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks00-stg-agw/rewriteRuleSets/pdda-public-display-data-aggregator"
          ~ name = "pdda-public-display-data-aggregator" -> "opal-external-api"
        }
      ~ rewrite_rule_set {
            id   = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks00-stg-agw/rewriteRuleSets/pdda-public-display-manager"
          ~ name = "pdda-public-display-manager" -> "pdda-public-display-data-aggregator"
        }
      + rewrite_rule_set {
          + name = "pdda-public-display-manager"
        }

      ~ ssl_policy {
          + min_protocol_version = "TLSv1_2"
            # (4 unchanged attributes hidden)
        }

        # (57 unchanged blocks hidden)
    }

  # module.backendappgateway.azurerm_monitor_diagnostic_setting.diagnostics_access_logs_sa[0] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "diagnostics_access_logs_sa" {
        id                             = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks00-stg-agw|app-gw-storage-account"
        name                           = "app-gw-storage-account"
        # (6 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (5 unchanged blocks hidden)
    }

  # module.privatedns.azurerm_private_dns_a_record.this["darts-external-component-test-harness"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "darts-external-component-test-harness"
      + records             = [
          + "10.148.32.138",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "staging.platform.hmcts.net"
    }

Plan: 1 to add, 2 to change, 0 to destroy.
```

</details>





## :warning: Errors

* add a label stg_backendappgateway - TerraformPlanApply/add-or-update: POST https://api.github.com/repos/hmcts/sds-azure-platform/issues/900/labels: 422 Validation Failed [{Resource:Label Field:name Code:invalid Message:}]
<!-- github-comment: {"Command":"plan","PRNumber":900,"Program":"tfcmt","SHA1":"","Target":"stg_backendappgateway - TerraformPlanApply","Vars":{}} -->